Revit 2027 API
PrintSetup.Delete Method
Delete the current print setting, and make the In-Session setting as the current one.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Delete()
Public Function Delete As Boolean
public:
bool Delete()
member Delete : unit -> bool
Return Value
Boolean
False if Delete operation fails, otherwise true.
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when the current print setting is In-Session.
See Also
Reference
PrintSetup Class
Autodesk.Revit.DB Namespace